In [ ]:
'''
Create DataFrame
    - List
    - List of Lists
    - Dictionary
    - List of Dictionary
    - From Dictionary of series.
    - Numpy Array
    - List of Tuples
    - Using zip()
    - Create DataFrame using Random Integer Generator
    - Create DaraFrame using Data Functionality 
        - Date Range,Frequency,start_end,
    - Read from External Files
        - Read from CSV
        - Read from excel
        - read_json
        - StringIO
        
    - Copy the DataFrame
    - Add records to dataframe using the .loc function
    - Creates a indexes for DataFrame using arrays.

In [3]:
import warnings
warnings.filterwarnings("ignore")

import numpy as np
import pandas as pd

In [4]:
#2 Create data frame from list

name = ['Santhosh','Anand','Sreedevi','Prashanth','Sachin']
age =[32,34,31,30,37]
company = ["Microsft","Google","Facebook","Tesla","Volvo"]

pd.DataFrame({"Name":name,"Age":age,"Company":company})

        Name  Age   Company
0   Santhosh   32  Microsft
1      Anand   34    Google
2   Sreedevi   31  Facebook
3  Prashanth   30     Tesla
4     Sachin   37     Volvo

In [5]:
#3 Create data frame from list of lists

data = [['Santhosh',32,'Microsoft'],
        ['Anand',34,'Google'],
        ['Sreedevi',31,'Facebook'],
        ['Prashanth',20,'Tesla'],
        ['Sachin',20,'Volvo']]

columns = ['Name','Age','Company']

pd.DataFrame(data,columns=columns)

        Name  Age    Company
0   Santhosh   32  Microsoft
1      Anand   34     Google
2   Sreedevi   31   Facebook
3  Prashanth   20      Tesla
4     Sachin   20      Volvo

In [6]:
#  From Dictionary

import pandas as pd
import numpy as np

dict = {"Name":["Santhosh","Anand","Sreedevi",'Prashanth','Sachin'],
        "Age":[32,34,31,30,35],
        "Sex":["Male","Male","Female","Male","Male"],
        "Company":["Microsft","Google","Facebook","Tesla","Volvo"],
        "Grade":["P1","P2","P1","P3","P1"]}

df = pd.DataFrame(dict)

df

        Name  Age     Sex   Company Grade
0   Santhosh   32    Male  Microsft    P1
1      Anand   34    Male    Google    P2
2   Sreedevi   31  Female  Facebook    P1
3  Prashanth   30    Male     Tesla    P3
4     Sachin   35    Male     Volvo    P1

In [7]:
#5 Creating Dataframe from list of dicts

data = [{'Name': 'Santhosh', 'Age':32, 'Company':'Microsft'},
        {'Name': 'Anand', 'Age':34, 'Company':'Google'},
        {'Name': 'Sreedevi', 'Age':31, 'Company':'Facebook'},
        {'Name': 'Prashanth', 'Age':30, 'Company':'Testla'},
        {'Name': 'Sachin', 'Age':35, 'Company':'Volvo'}]

pd.DataFrame(data)

        Name  Age   Company
0   Santhosh   32  Microsft
1      Anand   34    Google
2   Sreedevi   31  Facebook
3  Prashanth   30    Testla
4     Sachin   35     Volvo

In [8]:
#8 Creating DataFrame from Dicts of series.

d = {'one' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd']),
     'two' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd'])}
  
# creates Dataframe.
pd.DataFrame(d)

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [10]:
# Create DataFrame from pandas Series
data = {
    'Ad': pd.Series([
        'Furkan',
        'Kemal',
        'Osman',
        'Mehmet',
        'Şaban',
        'Zeynep',
        'Fatma',
        'Buse',
        'İrem',
        'Nihal'
    ]),
    'Yaş': pd.Series([
        21,
        25,
        30,
        24,
        28,
        26,
        29,
        32,
        21,
        25
    ]),
    'Meslek': pd.Series([
        'mühendis',
        'doktor',
        'polis',
        'pilot',
        'komedyen',
        'mimar',
        'avukat',
        'öğretmen',
        'diyetisyen',
        'hemşire'
    ])
}

df = pd.DataFrame(data)
print(df)

       Ad  Yaş      Meslek
0  Furkan   21    mühendis
1   Kemal   25      doktor
2   Osman   30       polis
3  Mehmet   24       pilot
4   Şaban   28    komedyen
5  Zeynep   26       mimar
6   Fatma   29      avukat
7    Buse   32    öğretmen
8    İrem   21  diyetisyen
9   Nihal   25     hemşire

In [12]:
#4 Create data frame from nummy array

# Example 1:

arry = np.array([[1,4,np.nan],[4,6,np.nan],[-3,5,2]])

columns = ['Column1','Column2','Column3']

pd.DataFrame(arry,columns=columns)

   Column1  Column2  Column3
0      1.0      4.0      NaN
1      4.0      6.0      NaN
2     -3.0      5.0      2.0

In [13]:
nparray = np.array( [['Emma', 'Oliver', 'Harry', 'Sophia'],
                     [29, 25, 33, 24],
                     ['HR', 'Finance', 'Marketing', 'IT']])

pd.DataFrame(nparray)

      0        1          2       3
0  Emma   Oliver      Harry  Sophia
1    29       25         33      24
2    HR  Finance  Marketing      IT

In [28]:
# List of Tuples

employees = [('Stuti', 28, 'Varanasi'),
            ('Saumya', 32, 'Delhi'),
            ('Aaditya', 25, 'Mumbai'),
            ('Saumya', 32, 'Delhi'),
            ('Saumya', 32, 'Delhi'),
            ('Saumya', 32, 'Mumbai'),
            ('Aaditya', 40, 'Dehradun'),
            ('Seema', 32, 'Delhi')
            ]
  
# Creating a DataFrame object
df = pd.DataFrame(employees,columns = ['Name', 'Age', 'City'])

df

      Name  Age      City
0    Stuti   28  Varanasi
1   Saumya   32     Delhi
2  Aaditya   25    Mumbai
3   Saumya   32     Delhi
4   Saumya   32     Delhi
5   Saumya   32    Mumbai
6  Aaditya   40  Dehradun
7    Seema   32     Delhi

In [14]:
#7 Creating DataFrame using zip() function.

name = ['Santhosh','Anand','Sreedevi','Prashanth','Sachin']
age =[32,34,31,30,37]
company = ["Microsoft",'Google','Facebook','Tesla','Volvo']

list_of_tuples = list(zip(name, age,company))

columns = ['Name','Age','Company']

pd.DataFrame(list_of_tuples,columns = columns)

        Name  Age    Company
0   Santhosh   32  Microsoft
1      Anand   34     Google
2   Sreedevi   31   Facebook
3  Prashanth   30      Tesla
4     Sachin   37      Volvo

In [15]:
#15 Creating DataFrame from the Random Integer Generator

df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])

df

       col2      col1
1 -1.740418 -0.465852
4 -0.674930  0.498233
6 -0.461159  0.552513
2 -0.157359 -0.177896
3  0.345314 -0.560798
5  1.576764  0.512807
9  0.423084 -0.691535
8 -0.287495  0.454004
0  1.095066 -0.108920
7  0.677527 -0.081310

In [16]:
# Create a Range of Dates
pd.DataFrame(pd.date_range('1/1/2011', periods=5))

           0
0 2011-01-01
1 2011-01-02
2 2011-01-03
3 2011-01-04
4 2011-01-05

In [17]:
# # Change the Date Frequency
pd.DataFrame(pd.date_range('1/1/2011', periods=5,freq='M'))

           0
0 2011-01-31
1 2011-02-28
2 2011-03-31
3 2011-04-30
4 2011-05-31

In [18]:
# bdate_range

pd.DataFrame(pd.date_range('1/1/2011', periods=5))

           0
0 2011-01-01
1 2011-01-02
2 2011-01-03
3 2011-01-04
4 2011-01-05

In [19]:
start = pd.datetime(2011, 1, 1)
end = pd.datetime(2011, 1, 5)

pd.DataFrame(pd.date_range(start, end))

           0
0 2011-01-01
1 2011-01-02
2 2011-01-03
3 2011-01-04
4 2011-01-05

In [20]:
#10 Read from the External Files

df = pd.read_csv("Titanic_train.csv")

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
#11
# From String Handle
# f is a file handle created from a csv like string

from io import StringIO

f = StringIO('Name,Age,Company\nSanthosh,32,Microsoft\nAnand,34,Google\nSreedevi,31,\
              Testla\nPrashanth,30,Tessco\nSachin,34,Volvo')

pd.read_csv(f)

        Name  Age               Company
0   Santhosh   32             Microsoft
1      Anand   34                Google
2   Sreedevi   31                Testla
3  Prashanth   30                Tessco
4     Sachin   34                 Volvo

In [23]:
#12 Using Read_JSON

df = pd.read_json("sample_Json.json",lines=True)
df.head(5)

        Name  Age    Company
0   Santhosh   32  Microsoft
1      Anand   34     Google
2   Sreedevi   31   FaceBook
3  Prashanth   30      Tesla
4     Sachin   35      Volvo

In [ ]:
#13 Read tables from an HTML page using the pandas library built in read_html

import pandas as pd
import requests

url = 'https://www.goodcarbadcar.net/2020-us-vehicle-sales-figures-by-brand'

r = requests.get(url)

#if the response status is OK (200)
if r.status_code == 200:
    car_data_tables = pd.read_html(r.text)
    
# display the first table
car_data_tables[0]

In [25]:
#14 Read from the External Files

df = pd.read_csv("Titanic_train.csv")

#14 Copy from Other DataFrames

df_copy = df.copy()

df_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
#9 Add records to dataframe using the .loc function

df = pd.DataFrame(columns=['Name','Age','Company'])

print(df)

df.loc[0] = ['Santhosh','32','Microsoft']
df.loc[1] = ['Anand','34','Google']
df.loc[2] = ['Sreedevi','31','Facebook']
df.loc[3] = ['Prashanth','30','Tesla']
df.loc[4] = ['Sachin','34','Volvo']

df

Empty DataFrame
Columns: [Name, Age, Company]
Index: []

        Name Age    Company
0   Santhosh  32  Microsoft
1      Anand  34     Google
2   Sreedevi  31   Facebook
3  Prashanth  30      Tesla
4     Sachin  34      Volvo

In [27]:
#6 Creates a indexes DataFrame using arrays.

dict = {"Name":['Santhosh','Anand','Sreedevi','Prashanth','Sachin'],
        "Age":[32,34,31,30,37],
        "Company":["Microsoft",'Google','Facebook','Tesla','Volvo']}

pd.DataFrame(dict,index=['rank1','rank2','rank3','rank4','rank5'])

            Name  Age    Company
rank1   Santhosh   32  Microsoft
rank2      Anand   34     Google
rank3   Sreedevi   31   Facebook
rank4  Prashanth   30      Tesla
rank5     Sachin   37      Volvo

Name    Aaditya
Age          25
City     Mumbai
Name: 2, dtype: object